Autodesk.AdvanceSteel.Modelling.PlateBase.SetOuterContour(Autodesk.AdvanceSteel.Geometry.Polyline3d,System.Collections.Generic.IEnumerable`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId}@,System.Collections.Generic.IEnumerable`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId}@)
Change the outer contour of the plate
contour: The new contour of the plate
deletedFeaturesIds: Deleted features ids. When change the plate contour some features may become invalid, for example the feature is outside of the new plate shape.
newFeaturesIds: New features ids created by the Advance Steel
Returns: Returns 1 if succeeded otherwise returns 0